# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

ch: 6
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]  # 0-P1/2
    # infrared
  - [0, 1, SilenceChannel, [3,6]]  # 1-P1/2   infrared 主分支  把输入和可见光分支交换即可切换主分支，其余不用动  Main branch: To switch to the main branch, simply swap the input and the visible light branch. The rest does not need to be changed.
  - [-1, 1, Conv, [64, 3, 2]] # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]


  # visible
  - [ 0, 1, SilenceChannel, [ 0,3 ] ]  # 7-P1/2  visible

  - [-1, 1, ZeroConv2d, [ 3,3, 1, 1]] # 8 (P5/32-large)
  - [[1, -1], 1, ADD, []]  # ADD backbone P3   9

  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 10-P1/2
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 11-P2/4
  - [ -1, 2, C3k2, [ 256, False, 0.25 ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 13-P3/8
  - [ -1, 2, C3k2, [ 512, False, 0.25 ] ] # 14

  - [-1, 1, ZeroConv2d, [ 512,3, 1, 1]] # 15 (P3/32-)
  - [[6, -1], 1, ADD, []]  # ADD backbone P3   16


  - [ 16, 1, Conv, [ 512, 3, 2 ] ] # 17-P4/16  infrared
  - [ -1, 2, C3k2, [ 512, True ] ]

  - [ 14, 1, Conv, [ 512, 3, 2 ] ] # 19-P4/16   visible
  - [ -1, 2, C3k2, [ 512, True ] ]  #20

  - [-1, 1, ZeroConv2d, [ 512, 3, 1,1]] # 21 (P4/16-)
  - [[18, -1], 1, ADD, []]  # ADD backbone P3   22

  - [ 22, 1, Conv, [ 1024, 3, 2 ] ] # 23-P5/32  infrared
  - [ -1, 2, C3k2, [ 1024, True ] ]

  - [ 20, 1, Conv, [ 1024, 3, 2 ] ] # 25-P5/32  visible
  - [ -1, 2, C3k2, [ 1024, True ] ]  #26


  - [-1, 1, ZeroConv2d, [  1024,3, 1,1]] # 27 (P5/32-large)
  - [[24, -1], 1, ADD, []]  # ADD backbone P3   28


  - [ -1, 1, SPPF, [ 1024, 5 ] ] # 29
  - [ -1, 2, C2PSA, [ 1024 ] ] # 30

# YOLO11n head
head:
  - [-1, 1, PConv, [512, 1]]  # 31, Y5, lateral_convs.0
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]

  - [[-1, 22], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 34
  - [-1, 3, VoVGSCSP,  [256]]  # 35, fpn_blocks.0

  - [-1, 1, PConv, [256, 1]]  # 36, Y4, lateral_convs.1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]

  - [[-1, 16], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 39 (P3/8-small)
  - [-1, 3, VoVGSCSP, [256]]  # X3 (40), fpn_blocks.1

  - [ -1, 1, GSConvE, [ 512, 3, 2 ]  ] # 41 downsample backbone P5
  - [[-1, 36], 1, Concat, [1]] # cat head P4
  - [-1, 3, VoVGSCSP, [512]]  # F4 (43), pan_blocks.0

  - [-1, 1, GSConvE, [ 1024, 3, 2 ] ]  # 44, downsample_convs.1
  - [[-1, 30], 1, Concat, [1]] # cat head P5
  - [-1, 3, VoVGSCSP, [1024]]  # F5 (46), pan_blocks.1

  - [[40, 43, 46], 1, Detect, [nc]] # Detect(P3, P4, P5)
